---
kind: enumMember
id: F:Autodesk.Revit.DB.LinkLoadResultType.UsedExisting
enum: Autodesk.Revit.DB.LinkLoadResultType
source: html/11b095e1-24d9-91b9-ae2e-004f67c94d6e.htm
---
# Autodesk.Revit.DB.LinkLoadResultType.UsedExisting

Revit already has a link with the input location, so the same link is been reused.